Autodesk.Revit.DB.Structure.FabricRoundingManager.ApplicableSegmentLengthRoundingMethod
The applicable rounding method for fabric segments.
Remarks:
IsActiveOnElement property of ReinforcementSettings RebarRoundingManager has to be true.
ApplicableSegmentLengthRoundingMethod is meaningless if ReinforcementSettings RebarRoundingManager IsActiveOnElement is false.
Since:
2017

Autodesk.Revit.DB.Structure.FabricRoundingManager.ApplicableSegmentLengthRounding
The applicable rounding for fabric segments.
Remarks:
IsActiveOnElement property of ReinforcementSettings RebarRoundingManager has to be true.
ApplicableSegmentLengthRounding is meaningless if ReinforcementSettings RebarRoundingManager IsActiveOnElement is false.
Since:
2017

Autodesk.Revit.DB.Structure.FabricRoundingManager.ApplicableTotalLengthRoundingMethod
The applicable rounding method for Cut Overall Length and Cut Overall Width parameters.
Remarks:
IsActiveOnElement property of ReinforcementSettings FabricRoundingManager has to be true.
ApplicableTotalLengthRoundingMethod is meaningless if ReinforcementSettings FabricRoundingManager IsActiveOnElement is false.
Since:
2016

Autodesk.Revit.DB.Structure.FabricRoundingManager.ApplicableTotalLengthRounding
The applicable rounding for Cut Overall Length and Cut Overall Width parameters.
Remarks:
IsActiveOnElement property of ReinforcementSettings FabricRoundingManager has to be true.
ApplicableTotalLengthRounding is meaningless if ReinforcementSettings FabricRoundingManager IsActiveOnElement is false.
Since:
2014

Autodesk.Revit.DB.Structure.FabricRoundingManager.SegmentLengthRoundingMethod
Identifies the segment length rounding method
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
When setting this property: None of the following disciplines is enabled: Structural.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
When setting this property: IsActiveOnElement property is false.
Since:
2017

Autodesk.Revit.DB.Structure.FabricRoundingManager.SegmentLengthRounding
The rounding for fabric segments.
Remarks:
IsActiveOnElement property has to be true. SegmentLengthRounding is meaningless if IsActiveOnElement is false.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: The given value for value is not a number
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: The rounding value is not a positive value.
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
When setting this property: None of the following disciplines is enabled: Structural.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
When setting this property: IsActiveOnElement property is false.
Since:
2017

Autodesk.Revit.DB.Structure.FabricRoundingManager.TotalLengthRoundingMethod
Identifies the total length rounding method
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
When setting this property: None of the following disciplines is enabled: Structural.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
When setting this property: IsActiveOnElement property is false.
Since:
2016

Autodesk.Revit.DB.Structure.FabricRoundingManager.TotalLengthRounding
The rounding for Cut Overall Length and Cut Overall Width parameters.
Remarks:
IsActiveOnElement property has to be true. TotalLengthRounding is meaningless if IsActiveOnElement is false.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: The given value for value is not a number
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: The rounding value is not a positive value.
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
When setting this property: None of the following disciplines is enabled: Structural.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
When setting this property: IsActiveOnElement property is false.
Since:
2014

Autodesk.Revit.DB.Structure.FabricRoundingManager.ApplicableReinforcementRoundingSource
Identifies the source of the rounding settings for this element.
Remarks:
For a FabricSheet or FabricArea element, this could be FabricArea, FabricSheetType, or ReinforcementSettings. For a FabricSheetType, this could be FabricSheetType or ReinforcementSettings.
All FabricSheets hosted by common FabricArea must have common reinforcement rounding overrides so at instance level its overrides are in FabricArea, not in FabricSheets.
Since:
2014

Autodesk.Revit.DB.Structure.FabricRoundingManager
Provides access to element reinforcement roundings overrides.
Remarks:
An instance of this class can be obtained from specific FabricSheetType or individual FabricSheet or FabricArea elements to apply overrides different from the global settings for the project.
Since:
2014